; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p3---int100n150-m25---int100c150---s7---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level21 level21)
(sum level0 level22 level22)
(sum level1 level1 level2)
(sum level1 level21 level22)
(sum level1 level22 level23)
(sum level2 level1 level3)
(sum level2 level21 level23)
(sum level2 level22 level24)
(sum level3 level1 level4)
(sum level3 level21 level24)
(sum level3 level22 level25)
(sum level4 level1 level5)
(sum level4 level21 level25)
(sum level4 level22 level26)
(sum level5 level1 level6)
(sum level5 level21 level26)
(sum level5 level22 level27)
(sum level6 level1 level7)
(sum level6 level21 level27)
(sum level6 level22 level28)
(sum level7 level1 level8)
(sum level7 level21 level28)
(sum level7 level22 level29)
(sum level8 level1 level9)
(sum level8 level21 level29)
(sum level8 level22 level30)
(sum level9 level1 level10)
(sum level9 level21 level30)
(sum level9 level22 level31)
(sum level10 level1 level11)
(sum level10 level21 level31)
(sum level10 level22 level32)
(sum level11 level1 level12)
(sum level11 level21 level32)
(sum level11 level22 level33)
(sum level12 level1 level13)
(sum level12 level21 level33)
(sum level12 level22 level34)
(sum level13 level1 level14)
(sum level13 level21 level34)
(sum level14 level1 level15)
(sum level15 level1 level16)
(sum level16 level1 level17)
(sum level17 level1 level18)
(sum level18 level1 level19)
(sum level19 level1 level20)
(sum level20 level1 level21)
(sum level21 level1 level22)
(sum level22 level1 level23)
(sum level23 level1 level24)
(sum level24 level1 level25)
(sum level25 level1 level26)
(sum level26 level1 level27)
(sum level27 level1 level28)
(sum level28 level1 level29)
(sum level29 level1 level30)
(sum level30 level1 level31)
(sum level31 level1 level32)
(sum level32 level1 level33)
(sum level33 level1 level34)

(connected l0 l1)
(fuelcost level21 l0 l1)
(connected l0 l2)
(fuelcost level22 l0 l2)
(connected l1 l0)
(fuelcost level21 l1 l0)
(connected l1 l2)
(fuelcost level1 l1 l2)
(connected l2 l0)
(fuelcost level22 l2 l0)
(connected l2 l1)
(fuelcost level1 l2 l1)

(at t0 l1)
(fuel t0 level34)
(= (total-cost) 0)

(at p0 l2)
(at p1 l2)
(at p2 l2)
)

(:goal
(and
(at p0 l0)
(at p1 l0)
(at p2 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l1 l2 level33 level1 level34)
   deleted: (at t0 l1) (fuel t0 level34)
   added: (at t0 l2) (fuel t0 level33)
   goals met: 0 of 3
2. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 0 of 3
3. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 0 of 3
4. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 0 of 3
5. (drive t0 l2 l1 level32 level1 level33)
   deleted: (at t0 l2) (fuel t0 level33)
   added: (at t0 l1) (fuel t0 level32)
   goals met: 0 of 3
6. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 1 of 3
7. (drive t0 l1 l0 level11 level21 level32)
   deleted: (at t0 l1) (fuel t0 level32)
   added: (at t0 l0) (fuel t0 level11)
   goals met: 1 of 3
8. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 2 of 3
9. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 3 of 3
